//
// Created by redmiX on 2026/4/15.
//

//******************************** Includes *********************************//
#include "user_config.h"
#include "Cpu.h"
#include "debug_timer.h"

#ifdef EN_DEBUG_TIMER
/*here include platform headers for driver*/
#include "DWT_delay.h"
#endif
//******************************** Includes *********************************//
//---------------------------------------------------------------------------//
//******************************** Defines **********************************//
//******************************** Defines **********************************//
//---------------------------------------------------------------------------//
//******************************** Macros ***********************************//
//******************************** Macros ***********************************//
//---------------------------------------------------------------------------//
//******************************** 函数声明   *********************************//
//******************************** 函数声明   *********************************//
//---------------------------------------------------------------------------//
//******************************** Variables ********************************//
//******************************** Variables ********************************//
//---------------------------------------------------------------------------//
//******************************** Functions ********************************//
#ifdef EN_DEBUG_TIMER

/*!
 * @brief  DEBUG_TIMER 调试定时器初始化函数
 * @return 无
 * @note   预留初始化接口，当前未实现具体初始化逻辑
 */
void DEBUG_TIMER_Init(void)
{
	DWT_Delay_Init();
}

/*!
 * @brief  获取调试定时器的计数值
 * @return 定时器当前计数值（uint32类型）
 * @note   预留接口，当前固定返回 0
 */
uint32_t DEBUG_TIMER_GetTimerValue(void)
{
//    // 定义定时器值变量，默认初始化为0
//	uint32 timerValue = 0u;
//
//    // 返回定时器计数值
//	return timerValue;
	uint32_t timerValue = DWT->CYCCNT;
	return timerValue;
}

/*!
 * @brief  DEBUG_TIMER 调试定时器反初始化函数
 * @return 无
 * @note   预留反初始化接口，当前未实现具体逻辑
 */
void DEBUG_TIMER_Deinit(void)
{

}

#endif
