//******************************** Includes *********************************//
#include "user_config.h"
#include "debug_IO.h"

#ifdef EN_DEBUG_IO
/*here include platform headers for driver*/
#endif
//******************************** Includes *********************************//
//---------------------------------------------------------------------------//
//******************************** Defines **********************************//
//******************************** Defines **********************************//
//---------------------------------------------------------------------------//
//******************************** Macros ***********************************//
//******************************** Macros ***********************************//
//---------------------------------------------------------------------------//
//******************************** 鍑芥暟澹版槑   *********************************//
//******************************** 鍑芥暟澹版槑   *********************************//
//---------------------------------------------------------------------------//
//******************************** Variables ********************************//
//******************************** Variables ********************************//
//---------------------------------------------------------------------------//
//******************************** Functions ********************************//
#ifdef EN_DEBUG_IO

/*!
 * @brief  DEBUG_IO璋冭瘯寮曡剼鍒濆鍖栧嚱鏁�
 * @return 鏃�
 * @note   寮曡剼鍒濆鍖栧凡鍦˙SP_init()鐨凱INS_DRV_Init()涓畬鎴愶紝姝ゅ鏃犻渶閲嶅閰嶇疆
 */
void DEBUG_IO_Init(void)
{

}

/*!
 * @brief  DEBUG_IO璋冭瘯寮曡剼鍙嶅垵濮嬪寲鍑芥暟
 * @return 鏃�
 * @note   棰勭暀鎺ュ彛锛屽綋鍓嶆棤鍙嶅垵濮嬪寲鎿嶄綔
 */
void DEBUG_IO_Deinit(void)
{

}

/*!
 * @brief  灏嗚皟璇曞紩鑴歅TD0杈撳嚭浣庣數骞�
 * @return 鏃�
 */
void DEBUG_IO_SetDebugIOLow(void)
{
    // PTD0寮曡剼杈撳嚭浣庣數骞�
	PINS_DRV_ClearPins(PTD, (1 << 0));
}

/*!
 * @brief  灏嗚皟璇曞紩鑴歅TD0杈撳嚭楂樼數骞�
 * @return 鏃�
 */
void DEBUG_IO_SetDebugIOHigh(void)
{
    // PTD0寮曡剼杈撳嚭楂樼數骞�
	PINS_DRV_SetPins(PTD, (1 << 0));
}

/*!
 * @brief  缈昏浆璋冭瘯寮曡剼PTD0鐨勭數骞崇姸鎬�
 * @return 鏃�
 */
void DEBUG_IO_ToggleDebugIO(void)
{
    // 缈昏浆PTD0寮曡剼鐢靛钩锛堥珮鍙樹綆/浣庡彉楂橈級
	PINS_DRV_TogglePins(PTD, (1 << 0));
}

#endif
